### Multi-index and Index Hierarchy

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [3]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [4]:
inside

[1, 2, 3, 1, 2, 3]

In [12]:
from numpy.random import randn
#np.random.seed(101) #same random number
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [9]:
df

             A         B
G1 1  2.706850  0.628133
   2  0.907969  0.503826
   3  0.651118 -0.319318
G2 1 -0.848077  0.605965
   2 -2.018168  0.740122
   3  0.528813 -0.589001

### Calling Multi-index

In [14]:
df.loc['G1']

          A         B
1 -0.116773  1.901755
2  0.238127  1.996652
3 -0.993263  0.196800

In [16]:
df.loc['G1'].loc[1]

A   -0.116773
B    1.901755
Name: 1, dtype: float64

In [19]:
df.index.names

FrozenList([None, None])

In [20]:
df.index.names = ['Groups','Num']

In [21]:
df

                   A         B
Groups Num
G1     1   -0.116773  1.901755
       2    0.238127  1.996652
       3   -0.993263  0.196800
G2     1   -1.136645  0.000366
       2    1.025984 -0.156598
       3   -0.031579  0.649826

In [23]:
df.loc['G2'].loc[2]

A    1.025984
B   -0.156598
Name: 2, dtype: float64

In [28]:
df.loc['G2'].loc[2].loc['B']

-0.15659790428898751

### Cross Section

In [34]:
df.xs('G1')

            A         B
Num
1   -0.116773  1.901755
2    0.238127  1.996652
3   -0.993263  0.196800

In [35]:
df

                   A         B
Groups Num
G1     1   -0.116773  1.901755
       2    0.238127  1.996652
       3   -0.993263  0.196800
G2     1   -1.136645  0.000366
       2    1.025984 -0.156598
       3   -0.031579  0.649826

In [33]:
df.xs(1,level='Num') ##advanced

               A         B
Groups
G1     -0.116773  1.901755
G2     -1.136645  0.000366

## Missing Data

In [36]:
import numpy as np
import pandas as pd

In [37]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [38]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [39]:
df=pd.DataFrame(d)

In [40]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

### Drop na method

In [42]:
df.dropna() #by default axis=1

     A    B  C
0  1.0  5.0  1

In [43]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [46]:
df.dropna(axis=1,thresh=2) ##condition based on number of na present

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [47]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

### Fill in na Method

In [50]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [53]:
df['A'].fillna(value=df['A'].mean()) #missing value filled with mean

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Group By

All to group together rows based of a column and perform an aggregate function such as sum, mean, std etc.

In [2]:
import numpy as np
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [5]:
df.groupby('Company')

In [6]:
byComp = df.groupby('Company')

In [7]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [8]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [10]:
byComp.std().loc['FB']

Sales    75.660426
Name: FB, dtype: float64

In [11]:
df.groupby('Company').std().iloc[0]

Sales    75.660426
Name: FB, dtype: float64

### Describe (statistic summary)

In [12]:
df.groupby('Company').describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]